# Data Analysis using Python Pandas

## Pandas
It is a very powerful data analysis and management tool
It supports:
- Data visualization
-

Two typees of Data Structures
- Series: One Dimensional
- Dataframe: Two Dimensional

In [2]:
# Importing
import pandas as pd

# Creating Series
ser=pd.Series([10,20,30,40])
print(ser)
print(ser[3])

0    10
1    20
2    30
3    40
dtype: int64
40

In [3]:
# Giving your own indexes. An advantage over numpy
srCaps = pd.Series(['NewDelhi','WashingtonDc','London','Paris'],index=['India','USA','UK','France'])
print(srCaps['India'])
print(srCaps[1]) # Works but will be deprecated

NewDelhi
WashingtonDc

/tmp/ipykernel_8033/4024110452.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(srCaps[1])

## Series Functions
`head()`: Returns first n members of the series. Default value is 5 <br>
`tail()`: Returns last n members of the series. Default value is 5 <br>
`count()`: Retusn total number of non NaN elements

## DataFrames
Can be created using dictionaries, lists, arrays, etc.

Q: Write a dictionary to store marks of 5 students scoring marks in 3 subjects

In [4]:
marks={
    'Stu1': [1,2,3],
    'Stu2': [2,3,4],
    'Stu3': [4,5,6],
    'Stu4': [7,8,9],
    'Stu5': [10,11,12],
}

print(marks)
# Works but wrong way to make dictionary if exporting to dataframe

{'Stu1': [1, 2, 3], 'Stu2': [2, 3, 4], 'Stu3': [4, 5, 6], 'Stu4': [7, 8, 9], 'Stu5': [10, 11, 12]}

In [7]:
# To make dataframe
marks={
    "Names":["John","Alice","Mark","Raj","Rohan"],
    "Major":[1,2,3,4,5],
    "Minor":[6,7,8,9,0],
    "OE":[11,12,13,14,15]
}
df=pd.DataFrame(marks)
print(df)
#print(df[0])  Doesn't work

   Names  Major  Minor  OE
0   John      1      6  11
1  Alice      2      7  12
2   Mark      3      8  13
3    Raj      4      9  14
4  Rohan      5      0  15

In [18]:
# To read csv
df = pd.read_csv('Data/employees.csv')
print(df[["FIRST_NAME","LAST_NAME"]])

     FIRST_NAME    LAST_NAME
0        Donald     OConnell
1       Douglas        Grant
2      Jennifer       Whalen
3       Michael    Hartstein
4           Pat          Fay
5         Susan       Mavris
6       Hermann         Baer
7       Shelley      Higgins
8       William        Gietz
9        Steven         King
10        Neena      Kochhar
11          Lex      De Haan
12    Alexander       Hunold
13        Bruce        Ernst
14        David       Austin
15        Valli    Pataballa
16        Diana      Lorentz
17        Nancy    Greenberg
18       Daniel       Faviet
19         John         Chen
20       Ismael      Sciarra
21  Jose Manuel        Urman
22         Luis         Popp
23          Den     Raphaely
24    Alexander         Khoo
25       Shelli        Baida
26        Sigal       Tobias
27          Guy       Himuro
28        Karen   Colmenares
29      Matthew        Weiss
30         Adam        Fripp
31        Payam     Kaufling
32       Shanta      Vollman
33        Kevin      Mourgos
34        Julia        Nayer
35        Irene  Mikkilineni
36        James       Landry
37       Steven       Markle
38        Laura       Bissot
39        Mozhe     Atkinson
40        James       Marlow
41           TJ        Olson
42        Jason       Mallin
43      Michael       Rogers
44           Ki          Gee
45        Hazel   Philtanker
46       Renske       Ladwig
47      Stephen       Stiles
48         John          Seo
49       Joshua        Patel

In [25]:
print(df[:5]) # First 5 records using slicing
print(df[-5:]) # Last 5 records using slicing
#print(df.tail())
#print(df.head()) Normal way to do it

   EMPLOYEE_ID FIRST_NAME  LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0          198     Donald   OConnell  DOCONNEL  650.507.9833  21-Jun-07
1          199    Douglas      Grant    DGRANT  650.507.9844  13-Jan-08
2          200   Jennifer     Whalen   JWHALEN  515.123.4444  17-Sep-03
3          201    Michael  Hartstein  MHARTSTE  515.123.5555  17-Feb-04
4          202        Pat        Fay      PFAY  603.123.6666  17-Aug-05

     JOB_ID  SALARY COMMISSION_PCT MANAGER_ID  DEPARTMENT_ID
0  SH_CLERK    2600             -         124             50
1  SH_CLERK    2600             -         124             50
2   AD_ASST    4400             -         101             10
3    MK_MAN   13000             -         100             20
4    MK_REP    6000             -         201             20
    EMPLOYEE_ID FIRST_NAME   LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
45          136      Hazel  Philtanker  HPHILTAN  650.127.1634  06-Feb-08
46          137     Renske      Ladwig   RLADWIG  650.121.1234  14-Jul-03
47          138    Stephen      Stiles   SSTILES  650.121.2034  26-Oct-05
48          139       John         Seo      JSEO  650.121.2019  12-Feb-06
49          140     Joshua       Patel    JPATEL  650.121.1834  06-Apr-06

      JOB_ID  SALARY COMMISSION_PCT MANAGER_ID  DEPARTMENT_ID
45  ST_CLERK    2200             -         122             50
46  ST_CLERK    3600             -         123             50
47  ST_CLERK    3200             -         123             50
48  ST_CLERK    2700             -         123             50
49  ST_CLERK    2500             -         123             50

In [44]:
# First 5 records but only first name and last name
print(df.iloc[:5,1:3])  # index location allows to slice columns and rows together

  FIRST_NAME  LAST_NAME
0     Donald   OConnell
1    Douglas      Grant
2   Jennifer     Whalen
3    Michael  Hartstein
4        Pat        Fay

In [51]:
# Display the details of the employees earning salary more than 5000
print(df[df["SALARY"]>5000][["FIRST_NAME","LAST_NAME","SALARY"]])

     FIRST_NAME  LAST_NAME  SALARY
3       Michael  Hartstein   13000
4           Pat        Fay    6000
5         Susan     Mavris    6500
6       Hermann       Baer   10000
7       Shelley    Higgins   12008
8       William      Gietz    8300
9        Steven       King   24000
10        Neena    Kochhar   17000
11          Lex    De Haan   17000
12    Alexander     Hunold    9000
13        Bruce      Ernst    6000
17        Nancy  Greenberg   12008
18       Daniel     Faviet    9000
19         John       Chen    8200
20       Ismael    Sciarra    7700
21  Jose Manuel      Urman    7800
22         Luis       Popp    6900
23          Den   Raphaely   11000
29      Matthew      Weiss    8000
30         Adam      Fripp    8200
31        Payam   Kaufling    7900
32       Shanta    Vollman    6500
33        Kevin    Mourgos    5800

In [55]:
# display the details of the person who earns the maximum salary
df.sort_values("SALARY",ascending=False).head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
9,100,Steven,King,SKING,515.123.4567,17-Jun-03,AD_PRES,24000,-,-,90
10,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-Sep-05,AD_VP,17000,-,100,90
11,102,Lex,De Haan,LDEHAAN,515.123.4569,13-Jan-01,AD_VP,17000,-,100,90
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
7,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-Jun-02,AC_MGR,12008,-,101,110

In [66]:
# Display the total salary earned at each job
print(df.groupby(by="JOB_ID")['SALARY'].sum().head())
# Display the Avg salary earned at each job
print("="*50)
print(df.groupby(by="JOB_ID")['SALARY'].mean().head())

JOB_ID
AC_ACCOUNT     8300
AC_MGR        12008
AD_ASST        4400
AD_PRES       24000
AD_VP         34000
Name: SALARY, dtype: int64
==================================================
JOB_ID
AC_ACCOUNT     8300.0
AC_MGR        12008.0
AD_ASST        4400.0
AD_PRES       24000.0
AD_VP         17000.0
Name: SALARY, dtype: float64

In [68]:
print(df[df["JOB_ID"]=="SH_CLERK"]['SALARY'].sum())

5200

In [71]:
# Display total number of employees working in each dept
print(df.groupby("DEPARTMENT_ID")["EMPLOYEE_ID"].count())

DEPARTMENT_ID
10      1
20      2
30      6
40      1
50     23
60      5
70      1
90      3
100     6
110     2
Name: EMPLOYEE_ID, dtype: int64

In [73]:
# Display how many employees are working under each manager
df.groupby("MANAGER_ID")["EMPLOYEE_ID"].count()

MANAGER_ID
 -     1
100    9
101    5
102    1
103    4
108    5
114    5
120    4
121    4
122    4
123    4
124    2
201    1
205    1
Name: EMPLOYEE_ID, dtype: int64